#+TITLE: WIGXJPF

Updated to use WIGXJPF 1.13

A fork of jagot's WIGXJPF.jl with parallelization & more up-to-date WIGXJPF.

The [[https://github.com/jagot/WIGXJPF.jl][original]] was deprecated in favour of [[https://github.com/Jutho/WignerSymbols.jl][WignerSymbols.jl]]
I've shifted to using [[https://github.com/JuliaBinaryWrappers/Wigxjpf_jll.jl/][Wigxjpf_jll]] instead of building the library directly. 
I will try to get WIGXJPF updated in [[https://github.com/JuliaPackaging/Yggdrasil][Yggdrasil]]

This is a Julia wrapper for the [[http://fy.chalmers.se/subatom/wigxjpf/][WIGXJPF]] library used to calculate Wigner 3j, 6j
and 9j symbols. Since the original library is release under the [[https://www.gnu.org/licenses/gpl-3.0.en.html][GPLv3]] license, so is this Julia wrapper.

* Example usage
  The original library expects all arguments to multiplied by two but the wrapper handles that internally. For
  instance, to calculate the 3j symbol (1 1 0; 0 0 0) = -1/√3, one
  would say
  #+BEGIN_SRC julia :exports both :session *julia*
    wig3j(1, 1, 0,
          0, 0, 0)
  #+END_SRC

  #+RESULTS:
  : -0.5773502691896258

  It also works for rational arguments:
  #+BEGIN_SRC julia :exports both :session *julia*
    wig3j(1//2,  1//2, 0,
          1//2, -1//2, 0)
  #+END_SRC

  #+RESULTS:
  : 0.7071067811865475
